app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC
---
    def index
      #@movies = Movie.all
      # @movies = Movie.all
      #if params[:sort_by].to_s == 'title'
      #  @title_sorting = 'hilite'
      #  @movies = Movie.all.order(params[:sort_by])
      #elsif params[:sort_by].to_s == 'release_date'
      #  @releasedate_sort = 'hilite'
      #  @movies = Movie.all.order(params[:sort_by])
      #else
      #  @movies = Movie.all
      #end
      #@movies = Movie.all
      @all_ratings = Movie.ratings_avail

      unless params[:ratings].nil?
        ratings_val = params[:ratings].keys
      else
        ratings_val = @all_ratings
      end
      @movies = Movie.where(rating:ratings_val)
      @display_ratings = ratings_val
      if params[:sort_by].to_s == 'title'
        @movies = Movie.where(rating:ratings_val).order(:title)
        @title_sorting = 'hilite'
      elsif params[:sort_by].to_s == 'release_date'
        @movies = Movie.where(rating:ratings_val).order(:release_date)